%**********微网模型**********%
%**********光伏模型**********
%取文献中的数据进行模拟
jingdu=121.488;
weidu=31.249;
fangweijiao=-31.249;
qinlang=0.47;
fanzhao=0.55;
Ppv_rate=1000;
qingxiejiao=33;
m=300;
fpv=0.8;
Ppv=-PV_model(jingdu,weidu,fangweijiao,qingxiejiao,qinlang,fanzhao,m,Ppv_rate,fpv)*10/1000;
for i=1:24
    if Ppv(i)<0
        Ppv(i)=0;
    end
end
%**********风电模型**********
vx=[10.27,9.34,10.52,10.67,10.48,11.45,10.28,9.9,10.92,8.94,8.91,9.7,10.68,11.02,13.92,14.16,12.81,10.58,8.04,9.07,10.43,10.4,9.97,11.71];
vx=vx*0.8;
Psite=Wind_model(vx)*10/1000;
%**********燃气轮机碳捕集系统模型***********
%**********微网优化调度模型***********

